Catalogs/НастройкиИнтеграцииМаркетплейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиИнтеграцииМаркетплейс</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСклада</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКабинета</Name>
					<Comment>businessID на Яндекс.Маркет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПлатежногоАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаАвтозагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СкладыМаркетплейс</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСклада</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторКабинета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСклада</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСкладовМаркетплейс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКонтрагентаДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбменСМаркетплейсВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьОтчетОПродажах(ПараметрыОтчета, УникальныйИдентификатор) Экспорт
	ПараметрыВыполнения = ДЛительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка отчета из маркетплейс'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "ОбменСМаркетплейс.ЗагрузитьОтчетОПродажах", ПараметрыОтчета);
КонецФункции

Функция ДоступенОбменСМаркетплейс() Экспорт
	
	Если РольДоступна("ПолныеПрава") Или РольДоступна("ДобавлениеИзменениеДанныхБухгалтерии") Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция НачатьПолучениеСпискаТоваров(НастройкаИнтеграции, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получения списка товаров маркетплейса'");
	
	Результат = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ОбменСМаркетплейс.СписокТоваровМаркетплейс", 
		НастройкаИнтеграции);
		
	Возврат Результат;
	
КонецФункции 

Процедура ОбработатьРезультатыСопоставления(РезультатыСопоставления, НастройкаИнтеграции) Экспорт
	ОбменСМаркетплейс.ОбработатьРезультатыСопоставления(РезультатыСопоставления, НастройкаИнтеграции);
КонецПроцедуры 

Функция ОбработатьРезультатПолученияСпискаТоваров(АдресСписокТоваровМаркетплейс) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",         Истина);
	Результат.Вставить("СообщениеОбОшибке",	"");
	Результат.Вставить("СписокТоваров",   	Новый Массив);
	Результат.Вставить("КодОтветаСервера",  0);
	
	РезультатПолученияСпискаТоваров = ПолучитьИзВременногоХранилища(АдресСписокТоваровМаркетплейс);
	
	Если НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатПолученияСпискаТоваров, "Результат", Ложь) Тогда
		Результат.Результат         = Ложь;
		Результат.СообщениеОбОшибке = РезультатПолученияСпискаТоваров.СообщениеОбОшибке;
		Если ТипЗнч(РезультатПолученияСпискаТоваров) = Тип("Структура") И РезультатПолученияСпискаТоваров.Свойство("СписокТоваров") Тогда 
			СписокТоваров = РезультатПолученияСпискаТоваров.СписокТоваров; 
			Если ТипЗнч(СписокТоваров) = Тип("Структура") И СписокТоваров.Свойство("КодОтветаСервера") Тогда
				Результат["КодОтветаСервера"] = СписокТоваров.КодОтветаСервера;
			КонецЕсли;
		КонецЕсли;
		Возврат Результат;                  
	КонецЕсли;
	
	СписокТоваровМаркетплейс = РезультатПолученияСпискаТоваров.СписокТоваров;
	
	СопоставлениеНоменклатуры = Новый Соответствие;
	
	// Найдем номенклатуру для которой сопоставления уже настроены
	ПараметрыПоиска = Новый ФиксированнаяСтруктура("НоменклатураКонтрагента", СписокТоваровМаркетплейс);
	МассивНайденнойНоменклатуры   = СопоставлениеНоменклатурыКонтрагентов.НайтиСоответствиеНоменклатуры(ПараметрыПоиска, Ложь);
	Для Каждого СтрокаНоменклатуры Из МассивНайденнойНоменклатуры Цикл
		Идентификатор = СтрокаНоменклатуры.НоменклатураКонтрагента.Идентификатор;
		Номенклатура  = СтрокаНоменклатуры.НоменклатураИБ.Номенклатура;
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			СопоставлениеНоменклатуры.Вставить(Идентификатор, Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	НастройкаИнтеграцииОбъект = РезультатПолученияСпискаТоваров.НастройкаИнтеграции.ПолучитьОбъект();
	Если НЕ НастройкаИнтеграцииОбъект.КаталогЗагружен Тогда
		ОбменСМаркетплейс.ОбработатьРезультатыСопоставления(МассивНайденнойНоменклатуры, НастройкаИнтеграцииОбъект.Ссылка);
		
		НастройкаИнтеграцииОбъект.КаталогЗагружен = Истина;
		НастройкаИнтеграцииОбъект.Записать();
	КонецЕсли;
	
	// Уберем из загруженной номенклатуры ту, для которой сопоставления уже настроены
	Для Каждого СтрокаНоменклатуры Из СписокТоваровМаркетплейс Цикл
		Если СопоставлениеНоменклатуры.Получить(СтрокаНоменклатуры.Идентификатор) = Неопределено Тогда
			Результат.СписокТоваров.Добавить(СтрокаНоменклатуры);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

Функция ИнтеграцияНастроена(НастройкаИнтеграции) Экспорт
	Возврат ОбменСМаркетплейс.ИнтеграцияНастроена(НастройкаИнтеграции);
КонецФункции

#Область НоваяАвторизацияЯндекс

//Получает владельца элемента справочника НастройкиИнтеграцииМаркетплейс
//Параметры: Настройка Тип("СправочникСсылка.НастройкиИнтеграцииМаркетплейс")
//
//Возвращаемое значение: Владлец Тип("СправочникСсылка.Орагнизации")
//
Функция ОрганизацияНастройки(Настройка) Экспорт
	
	Возврат Настройка.Владелец;
	
КонецФункции

//Получает настройку интеграции по уникальному идентификатору
//Параметры: УникальныйИдентификаторНастройки Тип("УникальныйИдентификатор")
//
//Возвращаемое значение: Настройка Тип("СпраовчникСсылка.НастройкиИнтеграцииМаркетплейс")
//
Функция ПолучитьНастройкуПоУникальномуИдентификатору(УникальныйИдентификаторНастройки) Экспорт
	
	Возврат Справочники.НастройкиИнтеграцииМаркетплейс.ПолучитьСсылку(УникальныйИдентификаторНастройки);
	
КонецФункции

//Получает настройку интеграции Яндекс.Маркет для организации
//Параметры: Организация тип("СправочникСсылка.Организации")
//
//Возвращаемое значение: Настройка Тип("СправочникСсылка.НастройкиИнтеграцииМаркетплейс")
//
Функция ПолучитьНастройкуИнтеграции(Организация) Экспорт
	
	Настройка = Справочники.НастройкиИнтеграцииМаркетплейс.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкиИнтеграцииМаркетплейс.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиИнтеграцииМаркетплейс КАК НастройкиИнтеграцииМаркетплейс
	|ГДЕ
	|	НастройкиИнтеграцииМаркетплейс.Владелец = &Организация
	|	И НастройкиИнтеграцииМаркетплейс.ВидМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыМаркетплейсов.ЯндексМаркет)";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Настройка = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Настройка;
	
КонецФункции

//Получает видмаркетплейса из настройки интеграции
Функция ВидМаркетплейсаНастройки(Настройка) Экспорт
	
	Возврат Настройка.ВидМаркетплейса;
	
КонецФункции

#КонецОбласти

#Область ОтложенноеСоспоставлениеНоменклатуры

// Формирует фоновое задание для заполнения документов ранее незаполненной номенклатурой
//
// Параметры:
//  Маркетплейс				 - ПеречислениеСсылка.ВидыМаркетплейсов - маркетплейс
//  НоменклатураКонтрагента	 - Массив - идентификаторы номенклатуры контрагента
//  УникальныйИдентификатор	 - УникальныйИдентификатор - идентификатор формы владельца
//  ДокументИсточник		 - ДокументСсылка - документ из формы которого запсукается фоновое создание
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьПроцедуру
//
Функция ОбновитьНесопоставленнуюНоменклатуру(Маркетплейс, НоменклатураКонтрагента, УникальныйИдентификатор, ДокументИсточник = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение документов сопоставленной номенклатурой'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"ОбменСМаркетплейс.ОбновитьНесопоставленнуюНоменклатуру",
		Маркетплейс,
		НоменклатураКонтрагента,
		ДокументИсточник);
		
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#Область БаннерСостояниеАвтозагрузки

Процедура ЗаписатьДатуЗакрытияБаннераСостояниеАвтозагрузки() Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		ИмяНастройкиСостояниеАвтозагрузки(),
		ИмяКлючаНастройкиДатаЗакрытияСостояниеАвтозагрузки(),
		ТекущаяДатаСеанса());
	
КонецПроцедуры

Функция ПолучитьДатуЗакрытияБаннераСостояниеАвтозагрузки() Экспорт
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ИмяНастройкиСостояниеАвтозагрузки(),
		ИмяКлючаНастройкиДатаЗакрытияСостояниеАвтозагрузки(),
		Дата(1, 1, 1));
	
КонецФункции

Функция ИмяНастройкиСостояниеАвтозагрузки()
	
	Возврат "СостояниеАвтозагрузкиДанныхМаркетплейсов";
	
КонецФункции

Функция ИмяКлючаНастройкиДатаЗакрытияСостояниеАвтозагрузки()
	
	Возврат "ДатаЗакрытияСостояниеАвтозагрузкиДанныхМаркетплейсов";
	
КонецФункции

#КонецОбласти

#КонецОбласти
